LQM2015/stm32/Core/Src/audio_recorder.c
    SHELL_LOG_USER_ERROR("Failed to restore SD card access");
    return -1;
}

/**
 * @brief Verify if a file exists on SD card (only when file is not currently open)
 * @param filepath: Path to check
 * @retval 0: File exists, -1: File doesn't exist
 */
static int verify_file_exists(const char* filepath)
{
    FILINFO fno;
    FRESULT res = f_stat(filepath, &fno);
    if (res == FR_OK) {
        SHELL_LOG_USER_INFO("File %s exists, size: %lu bytes", filepath, (unsigned long)fno.fsize);
        return 0;
    } else {
        SHELL_LOG_USER_WARNING("File %s does not exist, FRESULT: %d", filepath, res);
        return -1;
    }
}

/* Exported functions --------------------------------------------------------*/

/**
 * @brief Initialize audio recorder
 * @retval 0: Success, -1: Error
 */
int audio_recorder_init(void)
{
    SHELL_LOG_USER_INFO("Initializing audio recorder...");
    
    // 清零文件对象确保干净状态，添加内存屏障
    memset(&g_audio_file, 0, sizeof(FIL));
    __DSB();  // 确保内存清零完成
    
    // Initialize recorder structure
    recorder.channels = AUDIO_CHANNELS;
    recorder.bit_depth = AUDIO_BIT_DEPTH;
    recorder.sample_rate = AUDIO_SAMPLE_RATE;
    recorder.state = AUDIO_REC_IDLE;
    recorder.buffer_size = AUDIO_BUFFER_SIZE;
    recorder.bytes_written = 0;
    recorder.file_open = false;
    
    SHELL_LOG_USER_INFO("Config: %d channels, %d-bit, %d Hz, buffer size: %lu", 
           recorder.channels, recorder.bit_depth, recorder.sample_rate, (unsigned long)recorder.buffer_size);
    
    // Clear audio buffer
    memset(audio_buffer, 0, sizeof(audio_buffer));

    // Create message queue for audio data processing
    audio_data_queue = osMessageQueueNew(AUDIO_QUEUE_SIZE, sizeof(AudioDataItem_t), NULL);
    if (audio_data_queue == NULL) {
        SHELL_LOG_USER_ERROR("Failed to create audio data queue");
        return -1;
    }
    SHELL_LOG_USER_INFO("Audio data queue created with size: %d", AUDIO_QUEUE_SIZE);

    // Create audio processing thread
    const osThreadAttr_t audio_process_thread_attributes = {
        .name = "AudioProcess",
        .stack_size = 1024 * 8, // 增加到8KB栈，因为AudioDataItem_t包含大数组
        .priority = (osPriority_t) osPriorityHigh,
    };
    audio_process_thread_id = osThreadNew(audio_process_thread, NULL, &audio_process_thread_attributes);
    if (audio_process_thread_id == NULL) {
        SHELL_LOG_USER_ERROR("Failed to create audio processing thread");
        return -1;
    }
    
    SHELL_LOG_USER_INFO("Audio recorder initialization completed, state: %d", recorder.state);
    return 0;
}

/**
 * @brief Reset audio recorder to clean state (force reset)
 * @retval 0: Success, -1: Error
 */
int audio_recorder_reset(void)
{
    SHELL_LOG_USER_INFO("Force resetting audio recorder...");
    SHELL_LOG_USER_DEBUG("Current state before reset: %d", recorder.state);
    
    // Force stop SAI if it's running
    if (HAL_SAI_GetState(&hsai_BlockA4) != HAL_SAI_STATE_READY) {
        SHELL_LOG_USER_INFO("Forcing SAI DMA stop...");
        HAL_SAI_DMAStop(&hsai_BlockA4);
        HAL_SAI_Abort(&hsai_BlockA4);
        
        // Wait for SAI to stop
        uint32_t timeout = HAL_GetTick() + 200;
        while (HAL_SAI_GetState(&hsai_BlockA4) != HAL_SAI_STATE_READY && HAL_GetTick() < timeout) {
            vTaskDelay(1);
        }
    }
    
    // Force close file if it's open
    if (recorder.file_open) {
        SHELL_LOG_USER_INFO("Force closing file...");
        f_close(&g_audio_file);
        recorder.file_open = false;
    }
    
    // Clear file object
    memset(&g_audio_file, 0, sizeof(FIL));
    __DSB();
    
    // Reset all recorder state
    recorder.state = AUDIO_REC_IDLE;
    recorder.bytes_written = 0;
    recorder.write_in_progress = false;
    
    // Clear queue - remove any pending audio data items
    if (audio_data_queue != NULL) {
        AudioDataItem_t temp_item;
        // 清空队列中的所有待处理数据
        while (osMessageQueueGet(audio_data_queue, &temp_item, NULL, 0) == osOK) {
            // 数据已被丢弃
        }
        SHELL_LOG_USER_DEBUG("Audio data queue cleared");
    }
    
    // Reset counters
    rx_complete_counter = 0;
    rx_half_counter = 0;
    
    SHELL_LOG_USER_INFO("Audio recorder reset completed, state: %d", recorder.state);
    return 0;
}

/**
 * @brief Start audio recording
 * @retval 0: Success, -1: Error
 */
int audio_recorder_start(void)
{
    FRESULT res;
    
    SHELL_LOG_USER_INFO("Starting audio recording...");
    SHELL_LOG_USER_DEBUG("Current state: %d (IDLE=%d, RECORDING=%d, STOPPING=%d, ERROR=%d)", 
                         recorder.state, AUDIO_REC_IDLE, AUDIO_REC_RECORDING, AUDIO_REC_STOPPING, AUDIO_REC_ERROR);
    
    // 如果已经在录音，直接返回错误但用更友好的消息
    if (recorder.state == AUDIO_REC_RECORDING) {
        SHELL_LOG_USER_INFO("Audio recording is already active");
        return -1;
    }
    
    // 如果在任何非空闲状态，尝试强制重置
    if (recorder.state != AUDIO_REC_IDLE) {
        SHELL_LOG_USER_WARNING("Recorder not in idle state (%d), attempting force reset...", recorder.state);
        audio_recorder_reset();
        
        // 再次检查状态
        if (recorder.state != AUDIO_REC_IDLE) {
            SHELL_LOG_USER_ERROR("Failed to reset recorder to idle state, current: %d", recorder.state);
            return -1;
        }
        SHELL_LOG_USER_INFO("Recorder successfully reset to idle state");
    }
    
    // Check and fix SD card status first
    if (check_sd_card_status() != 0) {
        SHELL_LOG_USER_ERROR("SD card is not ready for recording");
        recorder.state = AUDIO_REC_ERROR;
        return -1;
    }
    
    // Reset SAI timing status and clear any error flags
    reset_sai_timing_status();
    
    // Check if SD card is mounted first
    SHELL_LOG_USER_DEBUG("Checking SD card mount status via global fs manager...");
    
    if (fs_manager_check_status() != 0) {
        SHELL_LOG_USER_ERROR("SD card not accessible via global fs manager");
        
        // 尝试通过文件系统管理器修复
        SHELL_LOG_USER_INFO("Attempting to fix SD card access via global fs manager...");
        
