LQM2015/stm32/Core/Src/audio_recorder.c
        if (close_result != FR_OK) {
            SHELL_LOG_USER_ERROR("Failed to close file after %d attempts, FRESULT: %d", max_close_attempts, close_result);
            overall_result = -1;
        } else {
            SHELL_LOG_USER_INFO("File handle closed successfully");
        }
        
        recorder.file_open = false;
        
    }
    
    // Always transition to idle state, even if there were errors
    recorder.state = AUDIO_REC_IDLE;
    SHELL_LOG_USER_INFO("Recording stopped, total bytes written: %lu", (unsigned long)recorder.bytes_written);
    SHELL_LOG_USER_DEBUG("State changed to idle: %d", recorder.state);
    
    // 现在文件已关闭，可以安全验证文件是否存在
    SHELL_LOG_USER_INFO("Verifying recorded file exists on SD card...");
    if (verify_file_exists(recorder.filename) == 0) {
        SHELL_LOG_USER_INFO("File verification successful - recorded file found on SD card");
    } else {
        SHELL_LOG_USER_ERROR("File verification failed - recorded file not found on SD card!");
    }
    
    if (overall_result == 0) {
        SHELL_LOG_USER_INFO("Audio recording stopped successfully");
    } else {
        SHELL_LOG_USER_WARNING("Audio recording stopped with errors");
    }
    
    return overall_result;
}

/**
 * @brief Get current recorder state
 * @retval Current state
 */
AudioRecorderState_t audio_recorder_get_state(void)
{
    return recorder.state;
}

/**
 * @brief Get total bytes written
 * @retval Bytes written
 */
uint32_t audio_recorder_get_bytes_written(void)
{
    return recorder.bytes_written;
}

/**
 * @brief Get current filename
 * @retval Filename string
 */
const char* audio_recorder_get_filename(void)
{
    return recorder.filename;
}

/**
 * @brief Debug current audio recorder status
 */
void audio_recorder_debug_status(void)
{
    SHELL_LOG_USER_INFO("=== Audio Recorder Status ===");
    SHELL_LOG_USER_INFO("State: %d", recorder.state);
    SHELL_LOG_USER_INFO("Channels: %d", recorder.channels);
    SHELL_LOG_USER_INFO("Bit depth: %d", recorder.bit_depth);
    SHELL_LOG_USER_INFO("Sample rate: %d", recorder.sample_rate);
    SHELL_LOG_USER_INFO("Buffer size: %lu", (unsigned long)recorder.buffer_size);
    SHELL_LOG_USER_INFO("Bytes written: %lu", (unsigned long)recorder.bytes_written);
    SHELL_LOG_USER_INFO("File open: %s", recorder.file_open ? "Yes" : "No");
    SHELL_LOG_USER_INFO("Filename: %s", recorder.filename);
    
    // 显示队列状态信息
    if (audio_data_queue != NULL) {
        uint32_t queue_space = osMessageQueueGetSpace(audio_data_queue);
        uint32_t queue_count = osMessageQueueGetCount(audio_data_queue);
        SHELL_LOG_USER_INFO("Audio queue status: %lu/%d items (space: %lu)", 
                           queue_count, AUDIO_QUEUE_SIZE, queue_space);
        
        if (queue_count >= (AUDIO_QUEUE_SIZE * 3 / 4)) {
            SHELL_LOG_USER_WARNING("Audio queue is nearly full - potential data loss risk!");
        }
    } else {
        SHELL_LOG_USER_ERROR("Audio queue is NULL!");
    }
    
    // Always check SD card status
    check_sd_card_status();
    
    if (recorder.state == AUDIO_REC_RECORDING) {
        debug_sai_status();
        
        // 检查当前缓冲区内容
        int current_non_zero = 0;
        for (int i = 0; i < 10 && i < AUDIO_BUFFER_SAMPLES; i++) {
            if (audio_buffer[i] != 0) current_non_zero++;
        }
        SHELL_LOG_USER_INFO("Current non-zero samples in first 10: %d", current_non_zero);
        SHELL_LOG_USER_INFO("First few samples: 0x%04X 0x%04X 0x%04X 0x%04X", 
                           audio_buffer[0], audio_buffer[1], audio_buffer[2], audio_buffer[3]);
    }
    
    SHELL_LOG_USER_INFO("=============================");
}

/**
 * @brief Check SD card status
 * @retval 0: Success, -1: Error
 */
int audio_recorder_check_sd_card(void)
{
    return check_sd_card_status();
}

/**
 * @brief Audio processing thread function
 * @param argument: Not used
 */
static void audio_process_thread(void *argument)
{
    (void)argument;
    AudioDataItem_t audio_item;
    
    SHELL_LOG_USER_INFO("Audio processing thread started");
    
    for (;;) {
        // Wait for audio data from the queue (blocking)
        osStatus_t status = osMessageQueueGet(audio_data_queue, &audio_item, NULL, osWaitForever);
        
        if (status == osOK) {
            //SHELL_LOG_USER_DEBUG("Processing audio data: %lu bytes", (unsigned long)audio_item.data_size);
            
            // Check if we're still recording
            if (recorder.state == AUDIO_REC_RECORDING) {
                // Process the received audio data
                int write_result = write_audio_data(audio_item.data, audio_item.data_size);
                
                if (write_result == -1) {
                    // 真正的写入错误
                    SHELL_LOG_USER_ERROR("Failed to write %s buffer, stopping recording.", 
                                        audio_item.is_half_buffer ? "first half" : "second half");
                    audio_recorder_stop();
                    recorder.state = AUDIO_REC_ERROR;
                } else if (write_result == -2) {
                    // 重入冲突，跳过但不设置错误状态
                    SHELL_LOG_USER_DEBUG("%s buffer write skipped due to reentry conflict",
                                        audio_item.is_half_buffer ? "First half" : "Second half");
                } else {
                    // 写入成功
                    // SHELL_LOG_USER_DEBUG("%s buffer written successfully",
                    //                     audio_item.is_half_buffer ? "First half" : "Second half");
                }
            } else {
                // 不在录音状态，丢弃数据
                SHELL_LOG_USER_DEBUG("Discarding audio data - not in recording state (state=%d)", recorder.state);
            }
        } else {
            SHELL_LOG_USER_WARNING("Failed to get audio data from queue, status: %d", status);
            // 短暂延时后继续
            osDelay(1);
        }
    }
}

/**
 * @brief Process audio data buffers. 
 * @note This function is now simplified as audio processing is handled by the queue-based thread.
 *       It only monitors SAI timing status.
 */
void audio_recorder_process(void)
{
    if (recorder.state != AUDIO_REC_RECORDING) {
        return;
    }

    // Monitor SAI timing status for Late Frame Sync issues
    monitor_sai_timing();
    
    // Note: Audio data processing is now handled by the audio_process_thread 
    // via queue mechanism for better real-time performance and data integrity.
}

/* Callback functions --------------------------------------------------------*/

/**
 * @brief SAI RX complete callback
 */
void audio_recorder_rx_complete_callback(void)
{
    /* Keep callbacks lightweight: reduced debug log frequency */
    rx_complete_counter++;
    if (rx_complete_counter % RX_CALLBACK_LOG_INTERVAL == 0) {
        SHELL_LOG_USER_DEBUG("SAI RX complete (%lu)", (unsigned long)rx_complete_counter);
    }
    
    if (recorder.state == AUDIO_REC_RECORDING) {
        //SHELL_LOG_USER_DEBUG("RX complete callback triggered");
        
        // 准备队列数据项 - 后半缓冲区
        AudioDataItem_t audio_item;
        
        // 复制DMA数据到独立缓冲区，避免被硬件覆盖
        uint16_t* source_ptr = &audio_buffer[AUDIO_BUFFER_SAMPLES / 2];  // 后半缓冲区
        memcpy(audio_item.data, source_ptr, AUDIO_HALF_BUFFER_SIZE);
        __DSB();  // 确保内存复制完成
        
